arduino/arduino-cli/internal/integrationtest/core/testdata/issue_1823/DxCore-dev/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) option        #
#________________________________________#
#    Completely speculative         #
#   Assumes same as Dx-series       #
#___________________________________#
#avrea.menu.bodvoltage.1v9=1.9V
#avrea.menu.bodvoltage.1v9.bootloader.bodlevbits=000
#avrea.menu.bodvoltage.2v45=2.45V
#avrea.menu.bodvoltage.2v45.bootloader.bodlevbits=001
#avrea.menu.bodvoltage.2v70=2.70V
#avrea.menu.bodvoltage.2v70.bootloader.bodlevbits=010
#avrea.menu.bodvoltage.2v85=2.85V
#avrea.menu.bodvoltage.2v85.bootloader.bodlevbits=011
#avrea.menu.bodmode.disabled=Disabled/Disabled
#avrea.menu.bodmode.enabled=Enabled/Enabled
#avrea.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
#avrea.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
#avrea.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
#avrea.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
#avrea.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
#avrea.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
#avrea.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
#avrea.menu.bodmode.disabled.bootloader.BODCFG=0x00
#avrea.menu.bodmode.enabled.bootloader.bodmodebits=00101
#avrea.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
#avrea.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
#avrea.menu.bodmode.samplefast.bootloader.bodmodebits=01010
#avrea.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
#avrea.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
#avrea.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
#avrea.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
#                                   #
#  Speculative but likely           #
#___________________________________#
#avrea.menu.eesave.enable=EEPROM retained
#avrea.menu.eesave.enable.bootloader.eesavebit=1
#avrea.menu.eesave.disable=EEPROM not retained
#avrea.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
#  Values speculative                #
#  Features Known                    #
#____________________________________#
#avrea.menu.resetupdipins.resetupdi=Reset & UPDI
#avrea.menu.resetupdipins.resetupdi.bootloader.resetpinbits=11
#avrea.menu.resetupdipins.inputupdi=Input & UPDI (no challenges)
#avrea.menu.resetupdipins.inputupdi.bootloader.resetpinbits=10
#avrea.menu.resetupdipins.resetgpio=Reset & GPIO (HV pulse RST for UPDI)
#avrea.menu.resetupdipins.resetgpio.bootloader.resetpinbits=01
#avrea.menu.resetupdipins.inputgpio=Input & GPIO (HV pulse RST for UPDI)
#avrea.menu.resetupdipins.inputgpio.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
#avrea.menu.millis.tcb2=TCB2 (recommended)
#avrea.menu.millis.disabled=Disabled
#avrea.menu.millis.tcb0=TCB0
#avrea.menu.millis.tcb1=TCB1
#avrea.menu.millis.tcb3=TCB3
#avrea.menu.millis.tca0=TCA0
#avrea.menu.millis.tca1=TCA1
##avrea.menu.millis.rtc=RTC (no micros)
##avrea.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
##avrea.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
#avrea.menu.millis.tcb0.build.millistimer=B0
#avrea.menu.millis.tcb1.build.millistimer=B1
#avrea.menu.millis.tcb2.build.millistimer=B2
#avrea.menu.millis.tcb3.build.millistimer=B3
#avrea.menu.millis.tca0.build.millistimer=A0
#avrea.menu.millis.tca1.build.millistimer=A1
##avrea.menu.millis.rtc.build.millistimer=RTC
##avrea.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
##avrea.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
#avrea.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
#avrea.menu.printf.default=Default, 1.5k flash, no floats
#avrea.menu.printf.full=Full, 2.6k, prints floats
#avrea.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrea.menu.printf.full.build.printfabr=.pfF
#avrea.menu.printf.minimal=Minimal, 1.1k flash used
#avrea.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrea.menu.printf.minimal.build.printfabr=.pfM


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
#avrea.menu.attach.allenabled=On all pins, like usual
#avrea.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
#avrea.menu.attach.manual=Only enabled ports. Please see documentation.
#avrea.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
#avrea.menu.attach.oldversion=Old version, may fix bugs.
#avrea.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
#avrea.menu.attach.manual.build.attachabr=.aMan
#avrea.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
#                                    #
#  Speculative but likely            #
#____________________________________#
#avrea.menu.startuptime.8=8ms
#avrea.menu.startuptime.1=0ms
#avrea.menu.startuptime.1=1ms
#avrea.menu.startuptime.2=2ms
#avrea.menu.startuptime.4=4ms
#avrea.menu.startuptime.16=16ms
#avrea.menu.startuptime.32=32ms
#avrea.menu.startuptime.64=64ms
#avrea.menu.startuptime.0.bootloader.SYSCFG1=0x00
#avrea.menu.startuptime.1.bootloader.SYSCFG1=0x01
#avrea.menu.startuptime.2.bootloader.SYSCFG1=0x02
#avrea.menu.startuptime.4.bootloader.SYSCFG1=0x03
#avrea.menu.startuptime.8.bootloader.SYSCFG1=0x04
#avrea.menu.startuptime.16.bootloader.SYSCFG1=0x05
#avrea.menu.startuptime.32.bootloader.SYSCFG1=0x06
#avrea.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
#avrea.menu.wiremode.mors1=1x Wire, Master or Slave
#avrea.menu.wiremode.mors1.build.wire.mode=MORS_SINGLE
#avrea.menu.wiremode.mors1.build.wireabr=.wO
#avrea.menu.wiremode.mands1=1x Wire, Master and Slave
#avrea.menu.wiremode.mands1.build.wire.mode=MANDS_SINGLE
#avrea.menu.wiremode.mands1.build.wireabr=.wA

#-------------------------------------#
# SPM from app incompatible with Dx   #
# version of flash write in major way #
#_____________________________________#

##########################################################################
#                                                                        #
#   ###  #     # ####      ####   ###            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # #####          #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  #   #           ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DA parts   #
#________________________________________#
avrdaopti.build.board=avrda
avrdaopti.build.core=dxcore
avrdaopti.build.f_cpu={build.speed}000000L
avrdaopti.build.text_section_start=.text=0x200
avrdaopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
avrdaopti.build.export_merged_output=true
avrdaopti.build.printf=

