arduino/arduino-cli/internal/integrationtest/core/testdata/issue_1823/DxCore-dev/megaavr/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
#avrddopti.menu.clock.24internal=24 MHz internal
#avrddopti.menu.clock.24internal.build.speed=24
#avrddopti.menu.clock.24internal.build.clocksource=0
#avrddopti.menu.clock.20internal=20 MHz internal
#avrddopti.menu.clock.20internal.build.speed=20
#avrddopti.menu.clock.20internal.build.clocksource=0
#avrddopti.menu.clock.16internal=16 MHz internal
#avrddopti.menu.clock.16internal.build.speed=16
#avrddopti.menu.clock.16internal.build.clocksource=0
#avrddopti.menu.clock.12internal=12 MHz internal
#avrddopti.menu.clock.12internal.build.speed=12
#avrddopti.menu.clock.12internal.build.clocksource=0
#avrddopti.menu.clock.10internal=10 MHz internal
#avrddopti.menu.clock.10internal.build.speed=10
#avrddopti.menu.clock.10internal.build.clocksource=0
#avrddopti.menu.clock.8internal=8 MHz internal
#avrddopti.menu.clock.8internal.build.speed=8
#avrddopti.menu.clock.8internal.build.clocksource=0
#avrddopti.menu.clock.4internal=4 MHz internal
#avrddopti.menu.clock.4internal.build.speed=4
#avrddopti.menu.clock.4internal.build.clocksource=0
#avrddopti.menu.clock.1internal=1 MHz internal
#avrddopti.menu.clock.1internal.build.speed=1
#avrddopti.menu.clock.1internal.build.clocksource=0
#avrddopti.menu.clock.24crystal=24 MHz crystal
#avrddopti.menu.clock.24crystal.build.speed=24
#avrddopti.menu.clock.24crystal.build.clocksource=1
#avrddopti.menu.clock.20crystal=20 MHz crystal
#avrddopti.menu.clock.20crystal.build.speed=20
#avrddopti.menu.clock.20crystal.build.clocksource=1
#avrddopti.menu.clock.16crystal=16 MHz crystal
#avrddopti.menu.clock.16crystal.build.speed=16
#avrddopti.menu.clock.16crystal.build.clocksource=1
#avrddopti.menu.clock.12crystal=12 MHz crystal
#avrddopti.menu.clock.12crystal.build.speed=12
#avrddopti.menu.clock.12crystal.build.clocksource=1
#avrddopti.menu.clock.8crystal=8 MHz crystal
#avrddopti.menu.clock.8crystal.build.speed=8
#avrddopti.menu.clock.8crystal.build.clocksource=1
#avrddopti.menu.clock.24extclock=24 MHz ext. clock
#avrddopti.menu.clock.24extclock.build.speed=24
#avrddopti.menu.clock.24extclock.build.clocksource=2
#avrddopti.menu.clock.20extclock=20 MHz ext. clock
#avrddopti.menu.clock.20extclock.build.speed=20
#avrddopti.menu.clock.20extclock.build.clocksource=2
#avrddopti.menu.clock.16extclock=16 MHz ext. clock
#avrddopti.menu.clock.16extclock.build.speed=16
#avrddopti.menu.clock.16extclock.build.clocksource=2
#avrddopti.menu.clock.12extclock=12 MHz ext. clock
#avrddopti.menu.clock.12extclock.build.speed=12
#avrddopti.menu.clock.12extclock.build.clocksource=2
#avrddopti.menu.clock.8extclock=8 MHz ext. clock
#avrddopti.menu.clock.8extclock.build.speed=8
#avrddopti.menu.clock.8extclock.build.clocksource=2
#avrddopti.menu.clock.28internal=28 MHz internal (overclocked)
#avrddopti.menu.clock.28internal.build.speed=28
#avrddopti.menu.clock.28internal.build.clocksource=0
#avrddopti.menu.clock.32internal=32 MHz internal (overclocked)
#avrddopti.menu.clock.32internal.build.speed=32
#avrddopti.menu.clock.32internal.build.clocksource=0
#avrddopti.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
#avrddopti.menu.clock.25crystal.build.speed=25
#avrddopti.menu.clock.25crystal.build.clocksource=1
#avrddopti.menu.clock.27crystal=27 MHz crystal (overclocked)
#avrddopti.menu.clock.27crystal.build.speed=27
#avrddopti.menu.clock.27crystal.build.clocksource=1
#avrddopti.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrddopti.menu.clock.28crystal.build.speed=28
#avrddopti.menu.clock.28crystal.build.clocksource=1
#avrddopti.menu.clock.30crystal=30 MHz ext. clock (overclocked)
#avrddopti.menu.clock.30crystal.build.speed=30
#avrddopti.menu.clock.30crystal.build.clocksource=1
#avrddopti.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrddopti.menu.clock.32crystal.build.speed=32
#avrddopti.menu.clock.32crystal.build.clocksource=1
#avrddopti.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrddopti.menu.clock.36crystal.build.speed=36
#avrddopti.menu.clock.36crystal.build.clocksource=1
#avrddopti.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrddopti.menu.clock.40crystal.build.speed=40
#avrddopti.menu.clock.40crystal.build.clocksource=1
#avrddopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
#avrddopti.menu.clock.25extclock.build.speed=25
#avrddopti.menu.clock.25extclock.build.clocksource=2
#avrddopti.menu.clock.27extclock=27 MHz ext. clock (overclocked)
#avrddopti.menu.clock.27extclock.build.speed=27
#avrddopti.menu.clock.27extclock.build.clocksource=2
#avrddopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrddopti.menu.clock.28extclock.build.speed=28
#avrddopti.menu.clock.28extclock.build.clocksource=2
#avrddopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
#avrddopti.menu.clock.30extclock.build.speed=30
#avrddopti.menu.clock.30extclock.build.clocksource=2
#avrddopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrddopti.menu.clock.32extclock.build.speed=32
#avrddopti.menu.clock.32extclock.build.clocksource=2
#avrddopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrddopti.menu.clock.36extclock.build.speed=36
#avrddopti.menu.clock.36extclock.build.clocksource=2
#avrddopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrddopti.menu.clock.40extclock.build.speed=40
#avrddopti.menu.clock.40extclock.build.clocksource=2
#avrddopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrddopti.menu.clock.48extclock.build.speed=48
#avrddopti.menu.clock.48extclock.build.clocksource=2

#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
#avrddopti.menu.bodvoltage.1v9=1.9V
#avrddopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
#avrddopti.menu.bodvoltage.2v45=2.45V
#avrddopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
#avrddopti.menu.bodvoltage.2v70=2.70V
#avrddopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
#avrddopti.menu.bodvoltage.2v85=2.85V
#avrddopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
#avrddopti.menu.bodmode.disabled=Disabled/Disabled
#avrddopti.menu.bodmode.enabled=Enabled/Enabled
#avrddopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
#avrddopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
#avrddopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
#avrddopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
#avrddopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
#avrddopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
#avrddopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
#avrddopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
#avrddopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
#avrddopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
#avrddopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
#avrddopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
#avrddopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
#avrddopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
#avrddopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
#avrddopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

