arduino/arduino-cli/internal/integrationtest/core/testdata/issue_1823/DxCore-dev/megaavr/boards.txt
#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
#avrddopti.menu.resetupdipinsopti.reset=Reset & UPDI
#avrddopti.menu.resetupdipinsopti.reset.bootloader.resetpinbits=11
#avrddopti.menu.resetupdipinsopti.input=Input & UPDI (no reset to enter optiboot)
#avrddopti.menu.resetupdipinsopti.input.bootloader.resetpinbits=10
#avrddopti.menu.resetupdipinsopti.reset=Reset & GPIO (HV pulse RST for UPDI)
#avrddopti.menu.resetupdipinsopti.reset.bootloader.resetpinbits=01
#avrddopti.menu.resetupdipinsopti.input=Input & GPIO (no reset, HV pulse for UPDI)
#avrddopti.menu.resetupdipinsopti.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
#avrddopti.menu.millis.tcbhighest=TCB2 on 28/32pin else TCB1 (recommended)
#avrddopti.menu.millis.disabled=Disabled (delay() only)
#avrddopti.menu.millis.tcb0=TCB0
#avrddopti.menu.millis.tcb1=TCB1 (same as first option on 14/20 pins)
#avrddopti.menu.millis.tcb0.build.millistimer={build.highestcb}
#avrddopti.menu.millis.tcb1.build.millistimer=B0
#avrddopti.menu.millis.tcb2.build.millistimer=B1
#avrddopti.menu.millis.tca0.build.millistimer=A0
#avrddopti.menu.millis.tcd0.build.millistimer=D0
#avrddopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
#avrddopti.menu.printf.default=Default, 1.5k flash, no floats
#avrddopti.menu.printf.full=Full, 2.6k, prints floats
#avrddopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrddopti.menu.printf.full.build.printfabr=.pfF
#avrddopti.menu.printf.minimal=Minimal, 1.1k flash used
#avrddopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrddopti.menu.printf.minimal.build.printfabr=.pfM


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
#avrddopti.menu.attach.allenabled=On all pins, like usual
#avrddopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
#avrddopti.menu.attach.manual=Only enabled ports. Please see documentation.
#avrddopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
#avrddopti.menu.attach.oldversion=Old version, may fix bugs.
#avrddopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
#avrddopti.menu.attach.manual.build.attachabr=.aMan
#avrddopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO                                   #
#________________________________________#
#avrddopti.menu.mvioopti.enabled=Enabled
#avrddopti.menu.mvioopti.enabled.bootloader.mviobits=01
#avrddopti.memu.mvioopti.enabled.build.MVIOenable=-DMVIO_ENABLED
#avrddopti.menu.mvioopti.disabled=Disabled
#avrddopti.menu.mvioopti.disabled.bootloader.mviobits=10
#avrddopti.memu.mvioopti.disabled.build.MVIOenable=
#avrddopti.menu.mvioopti.reallyenabled=Enabled and "burn bootloader" has for sure done w/this selected.
#avrddopti.menu.mvioopti.reallyenabled.bootloader.mviobits=01
#avrddopti.memu.mvioopti.reallyenabled.build.MVIOenable==-DMVIO_ENABLED -DASSUME_MVIO_FUSE
#avrddopti.menu.mvioopti.reallydisabled=Disabled and "burn bootloader" has for sure been done w/this selected.
#avrddopti.menu.mvioopti.reallydisabled.bootloader.mviobits=10
#avrddopti.memu.mvioopti.reallydisabled.build.MVIOenable=-DASSUME_MVIO_FUSE



#----------------------------------------#
# Startup time options                   #
#________________________________________#
#avrddopti.menu.startuptime.8=8ms
#avrddopti.menu.startuptime.0=0ms
#avrddopti.menu.startuptime.1=1ms
#avrddopti.menu.startuptime.2=2ms
#avrddopti.menu.startuptime.4=4ms
#avrddopti.menu.startuptime.16=16ms
#avrddopti.menu.startuptime.32=32ms
#avrddopti.menu.startuptime.64=64ms
#avrddopti.menu.startuptime.0.bootloader.sutbits=000
#avrddopti.menu.startuptime.1.bootloader.sutbits=001
#avrddopti.menu.startuptime.2.bootloader.sutbits=010
#avrddopti.menu.startuptime.4.bootloader.sutbits=011
#avrddopti.menu.startuptime.8.bootloader.sutbits=100
#avrddopti.menu.startuptime.16.bootloader.sutbits=101
#avrddopti.menu.startuptime.32.bootloader.sutbits=110
#avrddopti.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
#avrddopti.menu.wiremode.mors1=1x Wire, Master or Slave
#avrddopti.menu.wiremode.mors1.build.wire.mode=MORS_SINGLE
#avrddopti.menu.wiremode.mors1.build.wireabr=.wO
#avrddopti.menu.wiremode.mands1=1x Wire, Master and Slave
#avrddopti.menu.wiremode.mands1.build.wire.mode=MANDS_SINGLE
#avrddopti.menu.wiremode.mands1.build.wireabr=.wA

#----------------------------------------#
# Optiboot upload timeout                #
#________________________________________#
#avrddopti.menu.timeout.1sec=1 second (for use w/autoreset)
#avrddopti.menu.timeout.1sec.bootloader.timeout=
#avrddopti.menu.timeout.8sec=8 second (for use w/out autoreset)
#avrddopti.menu.timeout.8sec.bootloader.timeout=_8sec

#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
##avrddopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
##avrddopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
##avrddopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
##avrddopti.menu.bootloaderusart.ser0.bootloader.portswap=0
##avrddopti.menu.bootloaderusart.ser0_alt1=USART0 (alt1): TX PA4, RX PA5 (20+ pin only)
##avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.port=_ser0_alt1
##avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.portname=Serial
##avrddopti.menu.bootloaderusart.ser0_alt1.bootloader.portswap=1
##avrddopti.menu.bootloaderusart.ser0_alt2=USART0 (alt2): TX PA2, RX PA3 (20+ pin only)
##avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.port=_ser0_alt2
##avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.portname=Serial
##avrddopti.menu.bootloaderusart.ser0_alt2.bootloader.portswap=2
##avrddopti.menu.bootloaderusart.ser0_alt3=USART0 (alt3): TX PD4, RX PD5
##avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.port=_ser0_alt3
##avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.portname=Serial
##avrddopti.menu.bootloaderusart.ser0_alt3.bootloader.portswap=3
##avrddopti.menu.bootloaderusart.ser0_alt4=USART0 (alt4): TX PC1, RX PC2
##avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.port=_ser0_alt4
##avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.portname=Serial
##avrddopti.menu.bootloaderusart.ser0_alt4.bootloader.portswap=4
##avrddopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1 (28/32 pin only)
##avrddopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
##avrddopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
##avrddopti.menu.bootloaderusart.ser1.bootloader.portswap=0
##avrddopti.menu.bootloaderusart.ser1_alt2=USART1 (alt2): TX PD6, RX PD7
##avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.port=_ser1_alt2
##avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.portname=Serial1
##avrddopti.menu.bootloaderusart.ser1_alt2.bootloader.portswap=2


##########################################################################
#                                                                        #
#   ###  #     # ####      #####   ###           ###          #          #
#  #   # #     # #   #     #      #   #         #   #        ###  ##     #
#  #####  #   #  ####  ### ####   #####         #   #  ###    #          #
#  #   #   # #   # #       #      #   #         #   #  #  #   #   ##     #
#  #   #    #    #  #      #####  #   #          ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# We seriously don't know enough for     #
# this level of speculation.             #
#________________________________________#



